export const qnaData = [
  {
    question: "Data Labs에 지원하게 된 이유는?",
    answer: "평소 여행을 좋아하여 국내여행부터 해외여행까지 다양한 여행을 다니는 취미생활을 가지고 있습니다. MBTI는 ESTJ(계획적) 성향을 가지고 있어 계획적인 여행을 추구하는 사람으로써 네이버 블로그를 찾아보던 중 여행대로 어플을 접하게 되었고, 이로 인해 여행대로 어플을 사용하며 여행에 큰 도움을 받았지만 몇가지 개선점이 보이며 흥미를 가지게 되었습니다. 네이버 블로그부터 다양한 여행 플랫폼 사이트까지 많은 사전 조사를 하며 주변에 대한 맛집 정보도 많이 알고 있는건 물론, 어플을 자주 이용하는 다수 여행 플랫폼 고객입장 경험으로 불편함과 편리함을 느끼고 기억함으로써 유저의 니즈를 맞출 수 있는데 어려움이 없는 저에게 딱 맞는 기업이라고 생각되어 지원하게 되었습니다."
  },
  {
    question: "일에 있어 가장 중요하게 생각하는 것이 있다면?",
    answer: "저는 역지사지의 관점을 가장 중요하게 생각합니다. 동료와의 사람들과의 소통에서는 상대의 맥락과 제약을 먼저 이해하고, 고객을 대할 때는 “왜 이 기능이 필요한가”를 묻는 태도로 고객의 니즈를 데이터와 피드백으로 확인합니다. 이러한 방향성은 기능 보다 문제 정의를 선행하게 만들고, 결과적으로 여행대로의 사용성과 전환을 높일 것 입니다. 입사 후에는 이 관점을 바탕으로 데이터랩스의 목표 지표와 사용자의 여정을 연결해 실질적인 비즈니스 임팩트를 만들겠습니다."
  },
  {
    question: "Data Labs를 위해 어떤 자기계발을 해왔는지?",
    answer: "저는 Data Labs ‘여행대로’의 실시간 여행 경험을 확장하기 위해 웹/모바일 전반의 실전 역량을 집중적으로 키워왔습니다. HTML/CSS/JavaScript로 반응형과 크로스브라우징을 표준화하고, React·React Router·Zustand 기반 SPA에 TypeScript를 적용해 안정성과 유지보수성을 높인 경현이 있으며, Next.js(SSR/SEO)로 초기 가시성과 유입을 강화했었습니다. WebSocket·WebRTC로 채팅/영상통화 프로토타입을 구현해보고, React Native로 모바일/WebApp까지 연결했으며, Supabase·Node.js로 인증·DB가 연동된 경량 백엔드도 구축해 보았습니다. Figma·Illustrator·Photoshop으로 UI/UX 프로토타입을 빠르게 시각화하고, Styled-Components·Tailwind·Chakra UI로 일관된 UI를 퍼블리싱했으며, MCP를 사용한 AI 기반 코딩으로 반복을 자동화해 구현–실험 주기를 단축해 보았습니다. 이번 저의 자기계발은 사람들과의 소통을 원활히 하고 고객의 니즈를 제품에 반영하기 위한 것으로, 입사 후 여행대로의 유입·전환·재방문 등 핵심 지표를 체계적으로 끌어올리겠습니다."
  }
];
